with open('analyze.txt', 'w') as file:
 file.write("\n1. На сайте имеется шапка, включат в себя логотоп, видео и поиск.\n" 
            "\nПри скролинге, справа появляетс более развернутая версия.\n"
            "\n2. Подвал находится слева снизу, не скрывается.\n"
            "\n3. Контент располежени в центре страницы, отдельным блоками,\n" 
            "\nзанимающими половину экрана, часто с анимацией. В ленте есть реклама и подборка.\n"
            "\n4. Если я правильно изучила информацию об виждетах, то на сайте есть только подборка.")
            